package main

import (
	"fmt"
)

func main() {

	var str string = "Проверка"
	fmt.Println(str)

	//В отличии от других языков, мало функций для работы со слайсами. Гоферы придумали несколько приемов
	//которые позволяют решать частые задачи.

	//удаление последнего элемента слайса
	s := []int{1, 2, 3}
	fmt.Println(s)
	if len(s) != 0 { //защищаемся от паники
		s = s[:len(s)-1]
	}
	fmt.Println(s)

	//удаление первого элемента слайса
	sf := []int{1, 2, 3}
	fmt.Println(sf)
	if len(sf) != 0 { //защищаемся от паники
		sf = sf[1:]
	}
	fmt.Println(sf)

	//удаление элемента слайса с индексом
	si := []int{1, 2, 3, 4, 5}
	i := 2

	if len(si) != 0 && i < len(si)-1 { //защищаемся от паники

		si = append(si[:i], si[i+1:]...)
	}
	fmt.Println(si)
}
